app/controllers/notices_controller.rb

SELECT "notices".* FROM "notices"
---
  def index
    @notices = Notice.all

INSERT INTO "notices" ("title", "author", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "tyutyu"], ["author", "tytyu"], ["content", "tyutyutyut"], ["created_at", "2017-09-05 18:57:42.844547"], ["updated_at", "2017-09-05 18:57:42.844547"]]
---
  def create
    @notice = Notice.new(notice_params)

    if @notice.save